app/app/controllers/profiles_controller.rb

UPDATE "profiles" SET "role" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["role", 0], ["updated_at", "2025-05-22 21:07:58.903308"], ["id", 3]]
INSERT INTO "profiles" ("name", "city", "country", "gender", "birth", "role", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @profile = current_user.build_profile(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "gender" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["gender", "Female"], ["updated_at", "2025-05-20 06:02:17.119053"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)

DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 11]]
---
  def destroy
    @profile.destroy!