app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "is_confirmed?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "prueba@gmail.com"], ["password_digest", "[FILTERED]"], ["is_confirmed?", false], ["created_at", "2025-05-22 21:01:05.787935"], ["updated_at", "2025-05-22 21:01:05.787935"]]

  def destroy
    session[:user_id]=nil if current_user == @user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def confirm_email
    user = User.find_by(token: params[:token])
    user.update!(is_confirmed?: true)
---
SELECT "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "is_confirmed?" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_confirmed?", true], ["updated_at", "2025-06-03 17:55:14.105144"], ["id", 19]]