app/app/models/profile.rb

  def set_role
    self.update(role: 0)
---
UPDATE "profiles" SET "role" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["role", 0], ["updated_at", "2025-05-22 21:07:58.903308"], ["id", 3]]