app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new descrptiom"], ["description", "new descrptiom"], ["created_at", "2025-03-17 09:28:33.190025"], ["updated_at", "2025-03-17 09:28:33.190025"], ["user_id", 5]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["name", "A Pair of Socks"], ["description", "A pair of Laptops"], ["updated_at", "2025-03-08 07:24:13.425974"], ["id", 10]]